let ERROR_STR = `
    2|1A|AI1
    3|2A|AI2
    4|3A|AI3
    5|4A|AI4
    6|5A|AI5
    7|6A|AI6
    8|7A|AI7
    9|8A|AI8
    10|9A|AI9
    11|10A|AI10
    12|11A|AI11
    13|12A|AI12
    14|13A|AI13
    15|14A|AI14
    16|15A|AI15
    1|16A|AI16
    34|1d|DI1
    35|2d|DI2
    36|3d|DI3
    37|4d|DI4
    38|5d|DI5
    39|6d|DI6
    40|7d|DI7
    41|8d|DI8
    42|9d|DI9
    43|10d|DI10
    44|11d|DI11
    45|12d|DI12
    46|13d|DI13
    47|14d|DI14
    48|15d|DI15
    33|16d|DI16
    66|1E|通讯故障（1#机是主机与线控，其他是模块与主机）
    67|2E|机组机型设置冲突
    68|3E|时限保护
    69|4E|制冷环温过低
    70|5E|制热环温过高
    71|6E|系统制冷或制冷+热水出水温度过低
    72|7E|系统制热出水温度过高
    73|8E|热水水箱温度过高
    74|9E|主机与T8600或BAS通信故障
    75|10E|冬季冻结保护
    76|11E|模块制冷或制冷+热水出水温度过低1
    77|12E|模块制冷或制冷+热水出水温度过低2
    78|13E|模块制热出水温度过高1
    79|14E|模块制热出水温度过高2
    80|15E|模块制热出水温度过低1
    81|16E|模块制热出水温度过低2
    82|1F|压缩机排气温度过高1
    83|2F|压缩机排气温度过高2
    84|3F|压缩机排气温度过高3
    85|4F|压缩机排气温度过高4
    86|5F|制冷或制冷+热水板换（壳换）进口温度1过低
    87|6F|制冷或制冷+热水板换（壳换）进口温度2过低
    88|7F|制冷或制冷+热水板换（壳换）进口温度3过低
    89|8F|制冷或制冷+热水板换（壳换）进口温度4过低
    90|9F|板换冻结保护1
    91|10F|板换冻结保护2
    92|11F|板换冻结保护3
    93|12F|板换冻结保护4
    94|13F|热回收器冻结保护1
    95|14F|热回收器冻结保护2
    96|15F|四通阀切换失败保护
    97|16F|四通阀切换失败保护
    98|1p|模块内机型冲突
    99|2p|通讯故障（模块内）1（主板与变频器)
    100|3p|通讯故障（模块内）2
    101|4p|变频器型号不匹配1
    102|5p|变频器型号不匹配2
    103|6p|压缩机驱动器1多次报警
    104|7p|压缩机驱动器2多次报警
    105|8p|风机1高速报警
    106|9p|风机2高速报警
    107|10p|风机1低速报警
    108|11p|风机2低速报警
    109|12p|变频水泵通讯
    110|13p|变频水泵驱动失败
    111|14p|主板硬件故障
    112|15p|保留
    97|16p|保留
`;
export const ERRORS = ERROR_STR.trim()
    .split(/\s+/)
    .map(errInfo => {
    let data = errInfo.split('|');
    return {
        code: data[1],
        value: data[0],
        desc: data[2]
    };
});
export const TCP_CONFIG = {
    host: '10.10.100.254',
    port: 8899
};
export const API_CONFIG = {
    server: 'http://live.chinabolang.com:3250/api'
};
//# sourceMappingURL=constants.js.map